export const roleMap = {
  0: 'Admin',
  1: 'User'
}

export const timeRangeOptions = {
  0: '禁用',
  1: '00:00',
  2: '01:00',
  3: '02:00',
  4: '03:00',
  5: '04:00',
  6: '05:00',
  7: '06:00',
  8: '07:00',
  9: '08:00',
  10: '09:00',
  11: '10:00',
  12: '11:00',
  13: '12:00',
  14: '13:00',
  15: '14:00',
  16: '15:00',
  17: '16:00',
  18: '17:00',
  19: '18:00',
  20: '19:00',
  21: '20:00',
  22: '21:00',
  23: '22:00',
  24: '23:00'
}

export const timeWayOptions = {
  0: 'NTP',
  1: '基站',
  2: '手动'
}

export const netOptions = {
  0: '禁用',
  1: '远程网管',
  2: '集中网管'
}

export const fileTypeOptions = {
  0: '主程序',
  1: '配置',
  2: '业务数据',
  3: 'Ramfs',
  4: 'Kernel',
  5: 'UBoot',
  6: '调试工具',
  7: '小系统',
  8: '来电提示音',
  9: '语音配置',
  10: 'MAC文件',
  11: 'LIC文件',
  12: 'OpenVPN证书',
  13: '自定义'
}

export const fileSezeOptions = {
  0: '2M*2',
  1: '2M*3',
  2: '2M*4',
  3: '2M*5',
  4: '5M*2'
}
